{
  "gpc-revenue": {
    "label": "Research & Business Impact",
    "text": "Leading design for the digital transformation of a $8B e-commerce platform. Customer research uncovered a key insight: B2B parts lookup is fundamentally different from traditional e-commerce. Service advisors often have the part in hand — they need to identify it, not shop for it. The \"ways of finding\" strategy (keyword search, category search, part number lookup, job type, legacy PDF catalogs) delivered a 7% add-to-cart improvement representing a $32.8M lift in revenue for the pro segment (2025).",
    "stat": "$32.8M"
  },
  "bolt": {
    "label": "Bolt Design System",
    "text": "Built from scratch — no design system existed at GPC. My design engineering team (front-end engineers reporting into design) designed and built a global themeable design system end to end. Adopted across North America, Europe, and Asia Pacific. Reduced front-end development time by approximately 25%."
  },
  "agentic": {
    "label": "Agentic AI",
    "text": "Leading design for an internal AI/ML venture at NAPA — an agentic system for shop management and e-commerce.",
    "img": "/images/gpc/napa-logo.png"
  },
  "merger": {
    "label": "Truist · $66B Merger",
    "text": "The SunTrust–BB&T merger created Truist — the largest banking merger since 2008. Inheriting an innovation studio with an uncertain future, I rebooted it by adding customer journey mapping and strategic foresight. This repositioning earned a partnership with Corporate Strategy to run a major foresight exercise using the Jobs to Be Done framework, ultimately presenting three future-of-banking scenarios to the CEO and C-suite.",
    "quote": "Bill Rogers, the then-CEO of SunTrust, called the work \"instrumental\" in how he thought about the merger.",
    "img": "/images/truist/1771246115132-cd678175.png",
    "link": "/truist",
    "linkText": "View Truist project →"
  },
  "truist-products": {
    "label": "Product Rebuilds",
    "text": "Rebuilt Commercial Banking, Small Business, Retail, and Investment Banking products for the merged Truist entity. Each product line required unifying two distinct legacy systems under one coherent design language (designed by my team) while maintaining continuity for existing customers.",
    "img": "/images/truist/1771281469482-048153c4.png",
    "link": "/truist",
    "linkText": "View Truist project →"
  },
  "delta": {
    "label": "Delta Air Lines",
    "text": "Created news.delta.com — the corporate communications platform that serves Delta's media relations, employee engagement, and storytelling. A unified editorial system for a global airline with 90,000 employees.",
    "img": "/images/sparks-grove/news-hub.jpg",
    "link": "/sparks-grove",
    "linkText": "View Delta project →"
  },
  "clients": {
    "label": "Client Work",
    "text": "As Practice Lead at Sparks Grove (North Highland's design & innovation agency) led the shift from traditional agency model to agile software development and lean product management. Earned National Impact Award (2016) for transforming agency positioning to Human Experience Design."
  },
  "upwave": {
    "label": "Upwave · Turner Broadcasting",
    "text": "Zero to one product launch. An IoT-driven digital health venture at the intersection of wearables and personalized content delivery. Partnered with IDEO for market validation and product-market fit. Introduced lean product methodology enabling daily release cycles. The product was ahead of mainstream wearable adoption — pre-Apple Watch.",
    "img": "/images/upwave/turner-upwave-site.png",
    "link": "/upwave",
    "linkText": "View Upwave project →",
    "stat": "0 to 1M users in 8 months"
  },
  "emmy": {
    "label": "Emmy Award · 2011",
    "text": "Primetime Creative Arts Emmy — Outstanding Creative Achievement in Interactive Media for the \"Conan O'Brien Presents: Team Coco\" app. Team project, I led the design and development of the automatic content recognition (ACR) technology that powered the live sync-to-TV interactive experience. This was a team award; my contribution was the underlying sync to tv platform.",
    "img": "/images/awards/conan-emmy.png"
  },
  "patents": {
    "label": "Granted Patents",
    "text": "Two U.S. patents granted in 2015 for technology filed in 2011 at Turner Broadcasting. US9043821B2 covers automatic content recognition systems — the ability for a device to identify what's playing on a TV screen. US9167276B2 covers audience engagement technologies — systems for interactive second-screen experiences synchronized to live broadcast."
  },
  "magicwall": {
    "label": "CNN Magic Wall",
    "text": "Created the massive multi-touch screen paradigm for broadcast news visualization that became an industry standard. Designed large-format multi-touch interface that pioneered data-driven storytelling for weather and also used for election coverage at CNN.",
    "media": [
      "/images/cnn/magic-wall-hurricane.png",
      "/media/cnn-magic-wall.mp4"
    ]
  },
  "ar": {
    "label": "Mobile AR · 2005–2008",
    "text": "Pioneered the first mobile augmented reality applications in the United States — for NBA (billboard advertising interactions) and Cartoon Network (gaming) — in partnership with Georgia Tech. On Nokia N90 devices, before the iPhone existed. I predicted that mobile processing power and GPU trajectories would ensure AR happened on phones first. That prediction proved correct.",
    "media": [
      "/images/turner/nba-ar-prototype.png",
      "/media/nba-ar-prototype.mp4"
    ]
  },
  "dissertation": {
    "label": "March 1993",
    "text": "Undergraduate dissertation \"Colonizing Cyberspace\" predicted the transformative potential of global networked information spaces — 3D visualization of internet communities, virtual worlds for business and leisure. Described concepts now called \"spatial computing\" (Apple Vision Pro, Meta Quest). Predicted virtual communities and their cultural impact.",
    "quote": "Submitted March 1993. The Mosaic browser was publicly announced April 21, 1993 only one month later."
  },
  "backprop": {
    "label": "Neural Networks · 1993",
    "text": "Pioneered early AI tooling by building back-propagation learning capabilities into Apple's HyperCard via custom commands — the same foundational algorithm powering today's LLMs."
  },
  "bafta": {
    "label": "BAFTA Nomination",
    "text": "Nominated for a BAFTA Interactive Entertainment Award (Sports) in 2000 for 'Armchair Manager – Football', pioneering precursor to modern realtime interactive sports broadcasting.",
    "stat": "2000",
    "img": "/images/awards/bafta-nomination.jpg",
    "link": "/two-way-tv",
    "linkText": "View Two Way TV project →"
  },
  "apple-award": {
    "label": "Apple Design Award",
    "text": "Winner of the Apple Design Project Award (Problem Analysis) in an international inter-university competition.",
    "stat": "1994",
    "img": "/images/awards/apple-design-award.jpg"
  },
  "rts-award": {
    "label": "RTS Innovation Award",
    "text": "Winner of the UK Royal Television Society (RTS) Innovation Award for CNN's World Cup Twitter Buzz — a realtime interactive data visualization experience",
    "stat": "2010",
    "media": [
      "/images/awards/world-cup-twitter.png",
      "/media/world-cup-twitter.mp4"
    ]
  }
}